## Production: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 9 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                        NAME                         |
|--------|-----------------------------------------------------|
| add    | `aws_cloudwatch_log_group.prisma_migration_handler` |
|        | `aws_lambda_function.prisma_migration`              |
| update | `aws_iam_policy.lambda_s3`                          |
|        | `aws_lambda_function.audit_logs`                    |
|        | `aws_lambda_function.audit_logs_archiver`           |
|        | `aws_lambda_function.form_archiver`                 |
|        | `aws_lambda_function.nagware`                       |
|        | `aws_lambda_function.reliability`                   |
|        | `aws_lambda_function.reliability_dlq_consumer`      |
|        | `aws_lambda_function.response_archiver`             |
|        | `aws_lambda_function.submission`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.prisma_migration_handler will be created
  + resource "aws_cloudwatch_log_group" "prisma_migration_handler" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Prisma_Migration_Handler"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id               = "arn:aws:iam::957818836222:policy/lambda_s3"
        name             = "lambda_s3"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          + "arn:aws:s3:::forms-staging-prisma-migration-storage/*",
                          + "arn:aws:s3:::forms-staging-prisma-migration-storage",
                            "arn:aws:s3:::forms-production-vault-file-storage/*",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "audit-logs"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK"             = "false" -> null
                # (3 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs_archiver" {
        id                             = "audit-logs-archiver"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK"                           = "false" -> null
                # (3 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "form-archiver"
        tags                           = {}
        # (28 unchanged attributes hidden)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "nagware"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK"                = "false" -> null
                # (8 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.prisma_migration will be created
  + resource "aws_lambda_function" "prisma_migration" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "prisma-migration"
      + id                             = (known after apply)
      + image_uri                      = "test_url:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_URL_SECRET_ARN"     = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:server-database-url-jVtWGE"
              + "PRISMA_S3_BUCKET_NAME" = "forms-staging-prisma-migration-storage"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config {
          + log_format = "Text"
          + log_group  = "/aws/lambda/Prisma_Migration_Handler"
        }

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "reliability"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK"     = "false" -> null
                # (5 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "reliability-dlq-consumer"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK"                          = "false" -> null
                # (4 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "response-archiver"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK"                   = "false" -> null
                # (4 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
        tags                           = {}
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "LOCALSTACK" = "false" -> null
                # (2 unchanged elements hidden)
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0450b09572a6e347e",
            ]
          + subnet_ids                  = [
              + "subnet-025adc92b0ee815ba",
              + "subnet-05b9cd59ad60e88af",
              + "subnet-066cf27132a20a02a",
            ]
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.submission has moved to aws_lambda_permission.submission[0]
    resource "aws_lambda_permission" "submission" {
        id                  = "AllowInvokeECS"
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 9 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
